#+STARTUP: overview
#+TITLE: nur-packages
#+AUTHOR: Yus314

My personal [[https://github.com/nix-community/NUR][NUR]] repository
** Packages

#+begin_src shell :results output table :exports results
  echo Package, Description, Homepage, Platforms, License
  nix eval --raw .#packages.aarch64-darwin \
      --apply 'ps:
  builtins.concatStringsSep "\n" (
    builtins.map
      (
        p:
        "${ps.${p}.meta.name}, ${ps.${p}.meta.description}, ${ps.${p}.meta.homepage}, ${
          builtins.concatStringsSep " / " (
            builtins.filter (
              x: x == "x86_64-linux" || x == "aarch64-linux" || x == "x86_64-darwin" || x == "aarch64-darwin"
            ) ps.${p}.meta.platforms
          )
        }, ${ps.${p}.meta.license.shortName}"
      )
      (
        builtins.filter (x: !(x == "lib" || x == "modules" || x == "overlays" || x == "nurEmacsPackages")) (
          builtins.attrNames ps
        )
      )
  )'
#+end_src

#+RESULTS:
| Package                                              | Description                                                                                                                        | Homepage                                    | Platforms                                                     | License  |
| aquaskk-4.7.8                                        | An input method without morphological analysis                                                                                     | https://github.com/codefirst/aquaskk        | x86_64-darwin / aarch64-darwin / aarch64-linux / x86_64-linux | gpl2Only |
| bizin-gothic-nf-0.0.4                                | Bizin Gothic は、ユニバーサルデザインフォントの BIZ UDゴシック と英文フォント Inconsolata を合成したプログラミング向けフォントです | https://github.com/yuru7/bizin-gothic       | x86_64-darwin / aarch64-darwin / aarch64-linux / x86_64-linux | ofl      |
| cskk-1c010fd96afca2fbb7c9b584bd73eccfaf42c1b6        | C library version of libskk (SKK Japanese input method)                                                                            | https://github.com/naokiri/cskk             | x86_64-darwin / aarch64-darwin / aarch64-linux / x86_64-linux | gpl3Plus |
| fcitx5-cskk-ee9ce55d826daef2ae2e2721c18db28815724ae6 | SKK input method engine for Fcitx5 using libcskk                                                                                   | https://github.com/fcitx/fcitx5-cskk        | aarch64-linux / x86_64-linux                                  | gpl3Plus |
| niri-taskbar-v0.4.0+niri.25.11                       | Niri taskbar module for Waybar                                                                                                     | https://github.com/LawnGnome/niri-taskbar   | aarch64-linux / x86_64-linux                                  | mit      |
| nx-rbw-553d0f9d041b93d9600b424ae77cf3e2d6d096ae      | RBW (Rust BitWarden) integration for Nyxt browser                                                                                  | https://codeberg.org/ablatedsprocket/nx-rbw | x86_64-darwin / aarch64-darwin / aarch64-linux / x86_64-linux | gpl3Plus |
| nx-zotero-4a6b0ff72ae829b1789c1e21ce6c072b8af22da2   | Zotero integration for Nyxt browser                                                                                                | https://github.com/rolling-robot/nx-zotero  | x86_64-darwin / aarch64-darwin / aarch64-linux / x86_64-linux | asl20    |
| qutebrowser-3.6.1                                    | Keyboard-focused browser with a minimal GUI                                                                                        | https://github.com/qutebrowser/qutebrowser  | x86_64-darwin / aarch64-darwin / aarch64-linux / x86_64-linux | gpl3Plus |
| vivaldi-7.7.3851.54                                  | A Browser for our Friends powerful and personal                                                                                    | https://vivaldi.com                         | x86_64-linux / aarch64-linux / x86_64-darwin / aarch64-darwin | unfree   |
